{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"node": [{"name": "ppo2_model/pi/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/flatten_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ppo2_model/pi/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ArgMax/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ppo2_model/Ob", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "6"}, {"size": "6"}, {"size": "3"}]}}}}, {"name": "ppo2_model/pi/conv2d/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/pi/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/pi/conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/pi/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/pi/conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/pi/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/ToFloat", "op": "Cast", "input": ["ppo2_model/Ob"], "attr": {"SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/pi/Relu", "op": "_FusedConv2D", "input": ["ppo2_model/ToFloat", "ppo2_model/pi/conv2d/kernel", "ppo2_model/pi/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "ppo2_model/pi/Relu_1", "op": "_FusedConv2D", "input": ["ppo2_model/pi/Relu", "ppo2_model/pi/conv2d_1/kernel", "ppo2_model/pi/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "ppo2_model/pi/batch_normalization_2/FusedBatchNorm", "op": "_FusedConv2D", "input": ["ppo2_model/pi/Relu_1", "ppo2_model/pi/conv2d_2/kernel", "ppo2_model/pi/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "ppo2_model/pi/add", "op": "Add", "input": ["ppo2_model/pi/Relu", "ppo2_model/pi/batch_normalization_2/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/pi/Relu_2", "op": "Relu", "input": ["ppo2_model/pi/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ppo2_model/flatten_1/Reshape", "op": "Reshape", "input": ["ppo2_model/pi/Relu_2", "ppo2_model/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "ppo2_model/pi_1/MatMul", "op": "MatMul", "input": ["ppo2_model/flatten_1/Reshape", "ppo2_model/pi/w"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "ppo2_model/pi_1/add", "op": "Add", "input": ["ppo2_model/pi/b", "ppo2_model/pi_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ArgMax", "op": "ArgMax", "input": ["ppo2_model/pi_1/add", "ArgMax/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "ppo2_model/pi/b", "shape": [4], "dtype": "float32"}, {"name": "ppo2_model/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "ppo2_model/pi/w", "shape": [1152, 4], "dtype": "float32"}, {"name": "ArgMax/dimension", "shape": [], "dtype": "int32"}, {"name": "ppo2_model/pi/conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "ppo2_model/pi/conv2d/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "ppo2_model/pi/conv2d_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "ppo2_model/pi/conv2d_1/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "ppo2_model/pi/conv2d_2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "ppo2_model/pi/conv2d_2/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}]}]}