{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"node": [{"name": "deepq/q_func/conv2d/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deepq/q_func/conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deepq/q_func/conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deepq_2/q_func/Flatten/flatten/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deepq_2/q_func/Flatten/flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deepq_2/q_func/Flatten/flatten/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deepq/q_func/action_value/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deepq/q_func/action_value/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deepq/q_func/action_value/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deepq/q_func/action_value/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deepq_2/ArgMax/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "deepq_2/ToFloat", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "6"}, {"size": "3"}]}}}}, {"name": "deepq_2/q_func/conv2d/Conv2D", "op": "Conv2D", "input": ["deepq_2/ToFloat", "deepq/q_func/conv2d/kernel"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "deepq_2/q_func/Relu", "op": "Relu", "input": ["deepq_2/q_func/conv2d/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "deepq_2/q_func/conv2d_1/Conv2D", "op": "Conv2D", "input": ["deepq_2/q_func/Relu", "deepq/q_func/conv2d_1/kernel"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "deepq_2/q_func/Relu_1", "op": "Relu", "input": ["deepq_2/q_func/conv2d_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "deepq_2/q_func/conv2d_2/Conv2D", "op": "Conv2D", "input": ["deepq_2/q_func/Relu_1", "deepq/q_func/conv2d_2/kernel"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "deepq_2/q_func/add", "op": "Add", "input": ["deepq_2/q_func/Relu", "deepq_2/q_func/conv2d_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "deepq_2/q_func/Relu_2", "op": "Relu", "input": ["deepq_2/q_func/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "deepq_2/q_func/Flatten/flatten/Shape", "op": "Shape", "input": ["deepq_2/q_func/Relu_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "deepq_2/q_func/Flatten/flatten/strided_slice", "op": "StridedSlice", "input": ["deepq_2/q_func/Flatten/flatten/Shape", "deepq_2/q_func/Flatten/flatten/strided_slice/stack", "deepq_2/q_func/Flatten/flatten/strided_slice/stack_1", "deepq_2/q_func/Flatten/flatten/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "deepq_2/q_func/Flatten/flatten/Reshape/shape", "op": "Pack", "input": ["deepq_2/q_func/Flatten/flatten/strided_slice", "deepq_2/q_func/Flatten/flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "deepq_2/q_func/Flatten/flatten/Reshape", "op": "Reshape", "input": ["deepq_2/q_func/Relu_2", "deepq_2/q_func/Flatten/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "deepq_2/q_func/action_value/fully_connected/MatMul", "op": "MatMul", "input": ["deepq_2/q_func/Flatten/flatten/Reshape", "deepq/q_func/action_value/fully_connected/weights"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "deepq_2/q_func/action_value/fully_connected/BiasAdd", "op": "BiasAdd", "input": ["deepq_2/q_func/action_value/fully_connected/MatMul", "deepq/q_func/action_value/fully_connected/biases"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "deepq_2/q_func/action_value/Relu", "op": "Relu", "input": ["deepq_2/q_func/action_value/fully_connected/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "deepq_2/q_func/action_value/fully_connected_1/MatMul", "op": "MatMul", "input": ["deepq_2/q_func/action_value/Relu", "deepq/q_func/action_value/fully_connected_1/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "deepq_2/q_func/action_value/fully_connected_1/BiasAdd", "op": "BiasAdd", "input": ["deepq_2/q_func/action_value/fully_connected_1/MatMul", "deepq/q_func/action_value/fully_connected_1/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "deepq_2/ArgMax", "op": "ArgMax", "input": ["deepq_2/q_func/action_value/fully_connected_1/BiasAdd", "deepq_2/ArgMax/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "deepq/q_func/conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "deepq/q_func/conv2d_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "deepq/q_func/conv2d_2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "deepq_2/q_func/Flatten/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "deepq_2/q_func/Flatten/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deepq_2/q_func/Flatten/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "deepq/q_func/action_value/fully_connected/weights", "shape": [1152, 256], "dtype": "float32"}, {"name": "deepq/q_func/action_value/fully_connected/biases", "shape": [256], "dtype": "float32"}, {"name": "deepq/q_func/action_value/fully_connected_1/weights", "shape": [256, 4], "dtype": "float32"}, {"name": "deepq/q_func/action_value/fully_connected_1/biases", "shape": [4], "dtype": "float32"}, {"name": "deepq_2/ArgMax/dimension", "shape": [], "dtype": "int32"}]}]}